/* 文字列を受け取って処理してみよう  ------------------------------------------------------------------------------------------*/

    const string = prompt('Any message?');

    //Helloの場合
    console.log(string);        //Hello
    console.log(string.length); //5
    console.log(string[0]);     //H  //この配列は読み取り専用

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/


/* 文字列をすべて小文字や大文字にしたり、前後の空白を除去するための方法  ------------------------------------------------------------------------------------------*/

    //.toLowerCase()・・・大文字を小文字に変換
    //.toUpperCase()・・・小文字を大文字に変換
    //.trim()・・・空白の除去

    const string = prompt('Name?');
    // if (string.toLowerCase() === 'taro')
    if (string.toUpperCase().trim() === 'TARO') {
        console.log('Correct!');
    } else {
        console.log('Wrong!');
    }

/* ----------------------------------------------------------------------------------------------------------------------------------------------*/
